{"name":"Lucas G. de Queiroz","headerTaglineOne":"Olá,👋","headerTaglineTwo":"Eu sou o Lucas","headerTaglineThree":"Desenvolvedor Full-Stack","headerTaglineFour":"Desenvolvedor Mobile","showCursor":false,"showBlog":false,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/lucas1221","icon":"github"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/lucas-g-de-queiroz-655834214/","icon":"linkedin"},{"id":"5","title":"Email","link":"mailto:lucasgq71@gmail.com","icon":"email"}],"projects":[{"id":"3e12a6e4-9041-4fd1-9b1c-b5c96da1842b","title":"Desenvolvimento Front-End","description":" ","imageSrc":"https://img.freepik.com/free-vector/javascript-abstract-concept-illustration_335657-3702.jpg?w=826&t=st=1710922397~exp=1710922997~hmac=8c23db68db0d9813cb12ca303726e0069ea6d2aba3a5f454420ab1ee57eb46e5","url":" "},{"id":"f3225ae4-b742-4be8-92d5-9ef334c89db1","title":"Desenvolvimento Back-End","description":" ","imageSrc":"https://img.freepik.com/free-vector/data-management-collective-database-tower-people-share-commonplace-centralized-mainframe-widespread-info-stored-files-custom-regulation-vector-isolated-concept-metaphor-illustration_335657-2129.jpg?t=st=1710922784~exp=1710926384~hmac=20fe170ccc30986c0bbddcdc0d8fe0d52f8c50c59ded5bb8524930afef83c574&w=826","url":" "}],"services":[{"id":"1","title":"Front-End (Web e Mobile)","description":"React.js, React Native, Next.Js, Vue, Hooks, Context API, Axios para o Desenvolvimento de Websites e aplicativos para Android e iOS"},{"id":"2","title":"Back-End","description":"Node.Js, Express.Js, Python, MySQL, PostgreSQL, MariaDB, SequelizeORM para criar APIs velozes e modernas"},{"id":"3","title":"Java","description":"Spring, Hibernate para impulsionar diversos tipos de aplicativos Web, Mobile e Desktop"},{"id":"4","title":"Design","description":"Canva, GSuite, Office, Figma, Photoshop diversas ferramentas para UI/UX Design"},{"id":"0b306715-57d3-4165-b2c8-85383b96d247","title":"Suporte Técnico","description":"Fui Analista de Suporte técnico e amo trabalha com redes de computadores"}],"aboutpara":"Sou um desenvolvedor Full-Stack com uma paixão ardente por tecnologia e inovação. Meu amor pela resolução de problemas complexos e pela criação de soluções eficientes me levou a obter um bacharelado em Sistemas de Informação pela Universidade Federal de Mato Grosso do Sul.\n\nMinha experiência abrange uma variedade de frameworks e linguagens, incluindo Flutter, Node, Vue, React, React Native, Java, Python e PostgreSQL. No entanto, minha paixão não se limita apenas a aprender novas tecnologias. Eu me esforço para dominá-las, a fim de criar soluções inovadoras e de alta qualidade.\n\nNo meu último cargo, tive a oportunidade de trabalhar com uma variedade de tecnologias, incluindo Flutter, Node, NestJS, ElementUI, TypeORM, Vue 3 e Azure DevOps para CI/CD. Utilizei Git e adotei a metodologia ágil Scrum para garantir um fluxo de trabalho eficiente e colaborativo.\n\nAlém disso, tive a oportunidade de trabalhar com Apache Superset e Orchest, criando dashboards intuitivos e pipelines de dados eficientes. Essa experiência me permitiu contribuir significativamente para o desenvolvimento de soluções inovadoras para os clientes da empresa, sempre com foco na usabilidade, performance e segurança.\n\nTambém tive a honra de contribuir ativamente para os projetos Apache Superset e FlaskApp Builder, reforçando ainda mais minhas habilidades e conhecimentos.\n\nEstou ansioso para continuar minha jornada de aprendizado e aprimoramento de habilidades. Meu objetivo é enfrentar desafios cada vez maiores e causar um impacto significativo através do meu trabalho. Pretendo Evoluir meus conhecimentos em NoSQL e Machine Learning.\n","resume":{"tagline":"👋 Sou um Desenvolvedor de Software especializado nos mais modernos Frameworks disponíveis no mercado.","description":"Tenho experiência em diversos frameworks e linguagens, como Flutter(Dart), Node, Vue, React, React Native, Java, Python, PostgreSQL, entre outros.","experiences":[{"id":"1","dates":"Março de 2023 - Janeiro de 2024","type":"Efetivo","position":"Desenvolvedor Full-Stack na Dataway Tecnologia da Informação","bullets":"Atuei como desenvolvedor Full-Stack, Flutter, Node, NestJS, ElementUI, TypeORM, Vue 3, PostgreSQL, Azure DevOps para CI/CD, Git e SCRUM como metodologia ágil. Apache Superset, Orchest."},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"Fevereiro de 2023 - Março de 2023","type":"Efetivo","position":"Analista de Suporte Técnico na 3AM IT Services","bullets":"Suporte Técnico a Empresas em diversas localidades"},{"id":"ca5e22e6-ae35-4202-9a9f-2d24fb908e24","dates":"Janeiro de 2020 - Fevereiro de 2023","type":"Free lancer","position":"Desenvolvedor Free Lancer","bullets":"Desenvolvi sites e alguns aplicativos utilizando CMS(WordPress,  Joomla), Typescript, Babel, NPM, Yarn, React Native, React JS, Axios,  Sequelize, Next.JS/Gatsby, Node.JS, MySQL, XAMPP, Firebase"},{"id":"5382a433-94d2-4b73-ba26-a49f242412d7","dates":"Outubro de 2018 - Maio de 2020","type":"Estágio","position":"Desenvolvedor - Estagiário na Barbosa & Nantes LTDA","bullets":"Desenvolvedor Estagiario, desenvolvi o site http://pmlibano.com.br WordPress, PHP, WP-Bakery, Mail chimp e outras extensões WP.   Desenvolvi aplicativo Android para Totem usando React Native, RNFS, Bibliotecas de UI para o mesmo, Google Firebase e Google Cloud.   Desenvolvi sistema para controle de pedidos para pizzaria, usando Visual Basic e BD: Access.  Prestava Suporte Técnico a todos equipamentos de informática da empresa."}],"education":{"universityName":"Universidade Federal de Mato Grosso do Sul","universityDate":"2017-2021","universityPara":"Bacharel em Sistemas de Informação"},"languages":["Javascript","HTML5","CSS","Python","C/C++","Java","Swift"],"frameworks":["React","Typescript","NodeJs","React Native","Vue 3","NestJS","NextJS","Spring Boot, JPA, Hibernate"],"others":["Canva","Apache Superset","Azure","Apache Airflow","Azure DevOps","Office","Suporte Técnico de Sistemas"]}}