{"name":"Lucas G. de Queiroz","headerTaglineOne":"Olá,👋","headerTaglineTwo":"Eu sou o Lucas","headerTaglineThree":"Desenvolvedor Full-Stack","headerTaglineFour":"Desenvolvedor Mobile","showCursor":false,"showBlog":false,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/lucas1221","icon":"github"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/lucas-g-de-queiroz-655834214/","icon":"linkedin"},{"id":"5","title":"Email","link":"mailto:lucasgq71@gmail.com","icon":"email"}],"projects":[],"services":[{"id":"1","title":"Desenvolvimento Front-End (Web e Mobile)","description":"Typescript, React, React Native, NextJS, Vue 3, Hooks, Context API, Axios, Flutter, WordPress (Plug-ins como Elementor e WP-Bakery), TailwindCSS para o Desenvolvimento de Websites e aplicativos para Android e iOS"},{"id":"2","title":"Desenvolvimento Back-End","description":"NodeJs, ExpressJs, Python, MySQL, PostgreSQL, MongoDB, Firebase, MariaDB, SequelizeORM, TypeORM,  para criar APIs velozes e modernas"},{"id":"3","title":"Desenvolvimento Java","description":"Spring, Hibernate para impulsionar diversos tipos de aplicativos Web, Mobile e Desktop"},{"id":"4","title":"Design","description":"Canva, Figma, Microsoft Designer, Office, Figma, Photoshop são as ferramentas utilizadas para UI/UX Design"},{"id":"0b306715-57d3-4165-b2c8-85383b96d247","title":"Suporte Técnico","description":"Manutenção de computadores, servidores, bancos de dados e suporte aos usuários"},{"id":"83a1a2cb-aa53-45a2-85b3-0550fa09f32d","title":"CI/CD e Contêineres","description":"Azure DevOps, Github Actions, Apache Airflow, Docker, Kubernetes, Orchest "}],"aboutpara":"Sou um desenvolvedor Full-Stack com uma paixão ardente por tecnologia e inovação. Meu amor pela resolução de problemas complexos e pela criação de soluções eficientes me levou a obter um bacharelado em Sistemas de Informação pela Universidade Federal de Mato Grosso do Sul.\n\nMinha experiência abrange uma variedade de frameworks e linguagens, incluindo Flutter, Node, Vue, React, React Native, Java, Python e PostgreSQL. No entanto, minha paixão não se limita apenas a aprender novas tecnologias. Eu me esforço para dominá-las, a fim de criar soluções inovadoras e de alta qualidade.\n\nNo meu último cargo, tive a oportunidade de trabalhar com uma variedade de tecnologias, incluindo Flutter, Node, NestJS, ElementUI, TypeORM, Vue 3 e Azure DevOps para CI/CD. Utilizei Git e adotei a metodologia ágil Scrum para garantir um fluxo de trabalho eficiente e colaborativo.\n\nAlém disso, tive a oportunidade de trabalhar com Apache Superset e Orchest, criando dashboards intuitivos e pipelines de dados eficientes. Essa experiência me permitiu contribuir significativamente para o desenvolvimento de soluções inovadoras para os clientes da empresa, sempre com foco na usabilidade, performance e segurança.\n\nTambém tive a honra de contribuir ativamente para os projetos Apache Superset e FlaskApp Builder, reforçando ainda mais minhas habilidades e conhecimentos.\n\nEstou ansioso para continuar minha jornada de aprendizado e aprimoramento de habilidades. Meu objetivo é enfrentar desafios cada vez maiores e causar um impacto significativo através do meu trabalho. Pretendo Evoluir meus conhecimentos em NoSQL e Machine Learning.\n","resume":{"tagline":"👋 Sou um Desenvolvedor de Software especializado nos mais modernos Frameworks disponíveis no mercado.","description":"Tenho experiência em diversos frameworks e linguagens, como Node, Vue, React, React Native, Java, Python, PostgreSQL, entre outros.","experiences":[{"id":"1","dates":"Março de 2023 - Janeiro de 2024","type":"Efetivo","position":"Desenvolvedor Full-Stack na Dataway Tecnologia da Informação","bullets":"Flutter, Node, NestJS, ElementUI, TypeORM, Vue 3, PostgreSQL, Azure DevOps para CI/CD, Git e SCRUM como metodologia ágil, Apache Superset, Orchest."},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"Fevereiro de 2023 - Março de 2023","type":"Efetivo","position":"Analista de Suporte Técnico na 3AM IT Services","bullets":"Manutenção de hardware, manutenção de software, reparos em computadores, troca de componentes, formatação, reparo de bancos de dados "},{"id":"ca5e22e6-ae35-4202-9a9f-2d24fb908e24","dates":"Janeiro de 2020 - Fevereiro de 2023","type":"Free lancer","position":"Desenvolvedor Free Lancer","bullets":"CMS(WordPress,  Joomla), Typescript, Babel, NPM, Yarn, React Native, React JS, Axios,  Sequelize, NextJS, Gatsby, NodeJS, MySQL, XAMPP, Firebase"},{"id":"5382a433-94d2-4b73-ba26-a49f242412d7","dates":"Outubro de 2018 - Maio de 2020","type":"Estágio","position":"Desenvolvedor - Estagiário na Barbosa & Nantes LTDA","bullets":"Desenvolvedor Estagiario, Desenvolvi o site http://pmlibano.com.br, WordPress, PHP, WP-Bakery, Mail chimp, Outros plug-ins WordPress,   Desenvolvi aplicativo Android para Totem usando React Native, RNFS, React-Native-Elements, Google Firebase, Google Cloud Plataform,   Desenvolvi sistema para controle de pedidos para pizzaria usando Visual Basic e BD: Access,  Prestava Suporte Técnico a todos equipamentos de informática da empresa."}],"education":{"universityName":"Universidade Federal de Mato Grosso do Sul","universityDate":"2017-2021","universityPara":"Bacharel em Sistemas de Informação"},"languages":["Javascript","HTML5","CSS","Python","C/C++","Java","Swift"],"frameworks":["React","Typescript","NodeJs","React Native","Vue 3","NestJS","NextJS","Spring Boot, JPA, Hibernate"],"others":["Canva","Apache Superset","Azure","Apache Airflow","Azure DevOps","Office","Suporte Técnico de Sistemas"]}}